DataProcessors/Расписание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>Расписание</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ВремяУрока.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ВремяУрока</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоЗанятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеЗанятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Занятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаУрока</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Занятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Занятия</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебныйПлан</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НагрузкаГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖурналЗаполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Семестр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расписание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Занятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкаУрока</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дисциплина</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Дисциплины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кабинет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кабинеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Преподаватель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кадры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/Расписание/Forms/Форма/Ext/Form/Module.bsl
// Первоем открытие обработки
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Календарь = ТекущаяДата();
	ОбновитьПериодОтображения(ТекущаяДата());
КонецПроцедуры

// Выбор недели на расписании
&НаКлиенте
Процедура КалендарьПриАктивизацииДаты(Элемент)
	ОбновитьПериодОтображения(Календарь);
КонецПроцедуры

&НаСервере
Процедура ОбновитьПериодОтображения(Дата)
	Начало = НачалоНедели(Дата);
	Конец = КонецНедели(Дата);
	
	Расписание.ТекущиеПериодыОтображения.Очистить();
	Расписание.ТекущиеПериодыОтображения.Добавить(Начало, Конец);
	
	//Расписание.ЦветФона = Новый Цвет(0, 0, 0);
КонецПроцедуры

// Выбор расписания группы
&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	ЗаполнитьРасписание()
КонецПроцедуры

// Обновление расписания
&НаСервере
Процедура ЗаполнитьРасписание()
	Расписание.Элементы.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Занятия.Ссылка КАК Ссылка,
	|	Занятия.Группа КАК Группа,
	|	Занятия.ДатаРасписания КАК Дата,
	|	Занятия.Расписание.(
	|		НомерСтроки КАК НомерСтроки,
	|		Занятие КАК Занятие,
	|		Дисциплина КАК Дисциплина,
	|		Кабинет КАК Кабинет,
	|		Преподаватель КАК Преподаватель
	|	) КАК Расписание
	|ИЗ
	|	Документ.Занятия КАК Занятия
	|
	|ГДЕ
	|	Занятия.Группа = &Группа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	НомерСтроки");
	
	Запрос.УстановитьПараметр("Группа", Группа);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТаблицаЗанятий = Выборка.Расписание;
		ВыборкаТаблицыЗанятий = ТаблицаЗанятий.Выбрать();
		
		Пока ВыборкаТаблицыЗанятий.Следующий() Цикл
			Отбор = Новый Структура("Занятие", ВыборкаТаблицыЗанятий.Занятие);
			ВремяЗанятия = РегистрыСведений.ВремяУрока.ПолучитьПоследнее(Выборка.Дата, Отбор);
			
			ДатаНачала = НачалоДня(Выборка.Дата) + Час(ВремяЗанятия.НачалоЗанятия) * 60 * 60 + Минута(ВремяЗанятия.НачалоЗанятия) * 60;
			ДатаОкончания = НачалоДня(Выборка.Дата) + Час(ВремяЗанятия.ОкончаниеЗанятия) * 60 * 60 + Минута(ВремяЗанятия.ОкончаниеЗанятия) * 60;
			
			НовыйЭлемент = Расписание.Элементы.Добавить(ДатаНачала, ДатаОкончания);
			НовыйЭлемент.Текст = ВыборкаТаблицыЗанятий.Дисциплина;
			НовыйЭлемент.Значение = Выборка.Ссылка;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#Область Расписание

// Открытие документа при нажатии на элемент планировщика
&НаКлиенте
Процедура РасписаниеПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);
	
	ОткрытьФорму("Документ.Занятия.Форма.ФормаДокумента", ПараметрыФормы);
КонецПроцедуры

// Открытие документа при двойном нажатии
&НаКлиенте
Процедура РасписаниеПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);
	
	ОткрытьФорму("Документ.Занятия.Форма.ФормаДокумента", ПараметрыФормы);
КонецПроцедуры

// Запрет создания
&НаКлиенте
Процедура РасписаниеПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);
	
	ОткрытьФорму("Документ.Занятия.Форма.ФормаДокумента", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

// Кнопка обновить
&НаКлиенте
Процедура Обновить(Элемент)
	ЗаполнитьРасписание()
КонецПроцедуры

#КонецОбласти
